'''
Задача 5
Добавьте в модуль с загадками функцию, которая хранит словарь списков.
Ключ словаря - загадка, значение - список с отгадками.
Функция в цикле вызывает загадывающую функцию, чтобы передать ей все свои загадки.
'''

from Module.Module_Task_sem_5 import puzzle_solut


if __name__ == '__main__':
    print(puzzle_solut())
